#include <iostream>
#include <string>
#include <windows.h>
using namespace std;

void z1() {
	int d, m;
	string t;
	string month[] = { "января","февраля","марта","апреля","мая","июня","июля","августа","сентября","октября","ноября","декабря"};
	string day1[] = { "первое","второе","третье","четвертое","пятое","шестое","седьмое","восьмое","девятое","десятое"};
	string day2[] = { "один","две","три","четыр","пят","шес","сем","восем","девят" };
	cout << "Введите день и месяц >> ";
	cin >> d >> m;
	if (d > 31 || m > 12 || d <= 0 || m <= 0) {
		cout << "Неверно указанна дата\n";
		return;
	}
	if (d >= 1 && d <= 10) {
		t += day1[d - 1];
	}
	if (d > 10 && d < 20) {
		t += day2[(d % 10) - 1] + "надцатое";
	}
	if (d == 20) {
		t += "двадцатое";
	}
	if (d > 20 && d < 30) {
		t += "двадцать " + day1[(d % 10) - 1];
	}
	if (d == 30) {
		t += "тридцатое";
	}
	if (d == 31) {
		t += "тридцать первое";
	}
	t += " " + month[m - 1];
	cout << t << endl;
}

void z2() {
	int a, b, n;
	char r;
	string arr[] = { "Север","Восток","Юг","Запад" };
	cout << "Введите изначальное направление (С, Ю, З, В) и комманду >> ";
	cin >> r >> n;
	if (r != 'С' && r != 'Ю' && r != 'З' && r != 'В') {
		cout << "Неверно указано направление\n";
		return;
	}
	if (r == 'С') { a = 0; }
	if (r == 'Ю') { a = 2; }
	if (r == 'З') { a = 3; }
	if (r == 'В') { a = 1; }
	if (a + n <= 0) {
		b = abs(a + n) % 4;
	}
	else {
		b = 4 - (a + n) % 4;
		if (b == 4) { b = 0; };
	}

	cout << arr[b] << endl;

}

void z3() {
	int a;
	string t;
	string k1[] = { "десять","одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шеснадцать","семнадцать","восемнадцать","девятнадцать" };
	string k2[] = { "двадцать","тридцать","сорок" };
	string k3[] = { " одно"," два"," три"," четыре"," пять"," шесть"," семь"," восемь"," девять" };
	string u[] = { " учебное задание"," учебных заданий"," учебных задания" };
	cout << "Введите количество учебных заданий от 10 до 40 >> ";
	cin >> a;
	if (a < 10 || a > 40) {
		cout << "Количество заданий не попадает в диапазон\n";
		return;
	}
	if (a >= 10 && a < 20) {
		t += k1[a - 10] + u[1];
	}
	if (a >=20) {
		if (a % 10 == 0) {
			t += k2[(a / 10) - 2] + u[1];
		}
		if (a % 10 == 1) {
			t += k2[(a / 10) - 2] + k3[0] + u[0];
		}
		if (a % 10 > 1 && a % 10 < 5) {
			t += k2[(a / 10) - 2] + k3[a % 10 - 1] + u[2];
		}
		if (a % 10 >= 5) {
			t += k2[(a / 10) - 2] + k3[a % 10 - 1] + u[1];
		}
	}
	cout << t << endl;
}

void z4() {
	int a;
	string t;
	string s[] = { "сто","двести","триста","четыреста","пятьсот","шестьсот","семmсот","восемьсот","девятьсот" };
	string d1[] = { "десять","одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шеснадцать","семнадцать","восемнадцать","девятнадцать" };
	string d2[] = { "двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто" };
	string e[] = { "один","два","три","четыре","пять","шесть","семь","восемь","девять" };

	cout << "Введите число от 100 до 999 >> ";
	cin >> a;
	if (a < 100 || a > 999) {
		cout << "Число не попадает в диапазон\n";
		return;
	}
	t += s[(a / 100) - 1] + " ";
	if (a % 100 > 0) {
		if (a % 100 < 10) {
			t += e[(a % 10) - 1];
		}
		if (a % 100 >= 10 && a % 100 < 20) {
			t += d1[(a % 100) - 10];
		}
		if (a % 100 >= 20 && a % 10 == 0) {
			t += d2[((a % 100) / 10) - 2];
		}
		if (a % 100 >= 20 && a % 10 > 0) {
			t += d2[((a % 100) / 10) - 2] + " " + e[(a % 10) - 1];
		}
	}
	cout << t << endl;
}

void z5() {
	int a,b,g1,g2;
	string t;
	string c[] = { "зеленой","красной","желтой","белой","черной" };
	string c1[] = { "зеленого","красного","желтого","белого","черного" };
	string y[] = { "крысы","коровы","тигра","зайца","дракона","змеи","лошади","овцы","обезьяны","курицы","собаки","свиньи" };
	cout << "Введите год >> ";
	cin >> a;
	if (a < 0){
		cout << "Год не может быть отрицательным\n";
		return;
	}
	a -= 1984;
	if (a >= 0) {
		while (a >= 60) {
			a -= 60;
		}
		b = a / 12;
		if (b < 1) { g1 = 0; }
		else if (b < 2) { g1 = 1; }
		else if (b < 3) { g1 = 2; }
		else if (b < 4) { g1 = 3; }
		else if (b < 5) { g1 = 4; }
		
		while (a >= 12) {
			a -= 12;
		}
		g2 = a;
	}
	if (a < 0) {
		while (a <= -60) {
			a += 60;
		}
		b = abs(a / 12);
		if (b == 0 || a == -12) { g1 = 4; }
		else if (b == 1 || a == -24) { g1 = 3; }
		else if (b == 2 || a == -36) { g1 = 2; }
		else if (b == 3 || a == -48) { g1 = 1; }
		else if (b == 4 || a == -60) { g1 = 0; }
	
		while (a < -12) {
		a += 12;
		}
		g2 = 12 + a;
	}

	if (g2 >= 2 && g2 <= 4) {
		t += "Год " + c1[g1] + " " + y[g2];
	}
	else {
		t += "Год " + c[g1] + " " + y[g2];
	}
	cout << t << endl;
}

int main() {
	setlocale(LC_ALL, "Russian");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int f;
	cout << "Введите номер задания от 1 до 5, чтобы выйти введите 0 >> ";
	cin >> f;
	while (f != 0) {
		switch (f) {
		case 1: z1();
			break;
		case 2: z2();
			break;
		case 3: z3();
			break;
		case 4: z4();
			break;
		case 5: z5();
			break;
		}
		cout << "Введите номер задания от 1 до 5, чтобы выйти введите 0 >> ";
		cin >> f;
	}
}